{
    "About": "About Us",
    "Contact": "Contact Us",
    "Projects": "Projects",
    "Services": "Services",
    "Vacancies": "Vacancies",
    "english": "English",
    "arabic": "العربية",
    "footer.description": "We provide the highest standards of engineering safety requirements and strive to elevate the art and science of engineering while preserving the environment through the use of the latest tools and equipment. We are committed to offering a skilled technical team of qualified engineers with both academic and practical expertise, supported by cutting-edge technology. The firm specializes in designing and supervising projects in the fields of engineering consultancy and security and safety systems consultancy.",
    "footer.quickLinks": "Quick Links",
    "footer.requestQuote": "Request a Quote",
    "footer.aboutMadar": "About us",
    "footer.corePurposes": "Our Core Purposes and Values",
    "footer.news": "News",
    "footer.contactUs": "Contact Us",
    "footer.copyright": "© 2024 All rights reserved to PEC.",




    
      "language": "language",
      "Reliable Shipping Solutions for Your Business Needs": "Reliable Shipping Solutions for Your Business Needs",
      "We ensure timely deliveries with our seamless logistics services. From local to international shipping, we’re here to simplify your supply chain and drive your business forward.": "We ensure timely deliveries with our seamless logistics services. From local to international shipping, we’re here to simplify your supply chain and drive your business forward.",
      "First product": "First product",
      "Second product": "Second product",
      "TICKET CREATED":"TICKET CREATED",
      "PACKAGE RECEIVED":"PACKAGE RECEIVED",
      "OUT FOR DELIVERY":"OUT FOR DELIVERY",
      "Third product": "Third product",
      "Shipment Number": "Shipment Number",
      "Last Update": "Last Update",
      "Provider Name": "Provider Name",
      "Delivery Time": "Delivery Time",
      "Package Details":"Package Details",
      "Promised Address":"Promised Address",
      "Address":"Imbaba, Talaat Harb Street, Madinet El-Omal, near El-Prince Restaurant, IV House, Block 22, Cairo",
      "Problem":"Is there a problem with your shipment?!",
      "problems":"Report a problem",
        "Ticket Created": "Ticket Created",
        "Package Received": "Package Received",
        "In Transit": "In Transit",
        "Delivery Failed": "Delivery Failed",
        "Delivered to Sender": "Delivered to Sender",
        "DELIVERED TO SENDER":"Delivered to Sender",
        "Not Yet Shipped": "Not Yet Shipped",
        "Available For Pickup": "Available for Pickup",
        "Waiting For Customer Action": "Waiting for Customer Action",
        "CANCELLED": "Cancelled",
        "Out for Delivery": "Out for Delivery",
        "DELIVERED": "Delivered",
        "Madint Nasr":"Madint Nasr",
        "Date": "Date",
        "Time": "Time",
        "State": "State",
        "Location": "Location",
        "Showing": "Showing",
        "of": "of",
        "Previous": "Previous",
        "Next": "Next",
        "projects.title": "Our Projects",
        "projects.description": "We manage all stages of project development, starting from planning through design, construction, commissioning, and project closure. Our services aim to enhance project efficiency in terms of cost-effectiveness and timeliness while maintaining quality. Our capabilities combine expertise in planning, engineering, reporting, and management. At the same time, our team brings extensive experience in construction project management, utilizing the best practices, technologies, and project tools to achieve success. Additionally, our team establishes an effective and suitable assurance system to identify and address any deviations from the plan.",
        "projects.urban.title": "engineering authority",
        "projects.infrastructure.title": "Infrastructure Projects",
        "services.title":"Our Services",
        "services.description":"We provide the highest quality of engineering consultancy services we strive to advance of the engineering Our focus is on delivering a professional technical team with extensive academic and practical experience, projects in the fields of engineering and consultancy ",
        "services.projectManagement.title": "Project Management",
        "services.projectManagement.description": "PEC adopts effective project management strategies, tactics, and tools for managing the design and construction delivery processes and for controlling key factors to ensure that clients receive a facility that matches their expectations and functions as intended. To ensure successful project delivery, we implement management systems that control changes in scope, costs, schedule, and quality to maximize investment and enable the entire team to effectively carry out high-performance building projects. Our management goals are achieved through a structured process that includes multiple phases: initiating, planning, executing, monitoring, controlling, and closing. The project management process in PEC balances key project constraints and provides a tool for making decisions throughout the project based on stakeholder values, performance metrics, established procedures, and project goals.",
        "services.mepDesign.title": "MEP Design",
        "services.mepDesign.description": "PEC MEP (Mechanical, Electrical, and Plumbing) are referred to as technical disciplines in professional engineering service. PEC MEP designs are making buildings comfortable. Our designs make a difference in your daily life by providing: lighting to illuminate spaces that would otherwise be dark, air conditioning and heating for comfort, running water at sinks and toilets, ventilation to improve productivity and prevent illness, power for devices like computers and security systems, and ensuring that wastewater from sinks, showers, and toilets are disposed of properly.",
        "services.architectureDesign.title": "Architecture Design",
        "services.architectureDesign.description": "PEC practice focuses on adding aesthetic, technical, and sustainable values to our clients' investments. We provide adaptable, cost-effective, context-sensitive architecture that engages people's imagination. Our work ranges from the architectural design and engineering of individual houses to participation in master planning and entire communities to on-call services for a variety of projects. The team members have conceived, designed, and built projects that include administrative headquarters, government buildings, educational centers, healthcare facilities, recreational & sports resorts, industrial complexes, and residential developments.",
        "services.constructionSupervision.title": "Infrastructure",
        "services.constructionSupervision.description": "Services of PEC extend well in infrastructure design works including the services and facilities necessary for the economy to function. We are composed of public and private physical structures such as roads, bridges, tunnels, water supply, sewers, electrical systems, and telecommunications. Our comprehensive supervision ensures quality control and adherence to project specifications throughout the construction process.",
        "services.urbanPlanning.title": "Urban Planning ",
        "services.urbanPlanning.description": "PEC's urban design and planning practice encompasses new town planning, master planning, and urban planning. Our Urban Design and Planning Services include: site selection studies, project feasibility analysis, master planning and design, environmental analysis and planning, and architecture landscaping. We create sustainable, functional, and aesthetically pleasing urban environments.",
        "services.structureDesign.title": "Structure Design",
        "services.structureDesign.description": "PEC provides complete structure design starting from creating structure system alternatives to reach the ideal design that balances safety and cost. In addition to shop drawings, coordination, and as-built drawings for structural systems that are accurate and thoughtfully prepared, the services we offer include drawings for installation details, technical specifications, and system calculations.",
        "contact.firstName": "First name",
        "contact.lastName": "Last name",
        "contact.email": "Email",
        "contact.phone": "Phone number",
        "contact.company": "Company",
        "contact.department": "Department",
        "contact.message": "Message",
        "contact.send": "Send",
        "contact.sending": "Sending...",
        "contact.successMessage": "Message sent successfully! We'll get back to you soon.",
        "contact.errorMessage": "Failed to send message. Please try again or contact us directly.",
        "contact.validation.firstNameRequired": "First name is required",
        "contact.validation.firstNameMin": "First name must be at least 2 characters",
        "contact.validation.lastNameRequired": "Last name is required",
        "contact.validation.lastNameMin": "Last name must be at least 2 characters",
        "contact.validation.emailRequired": "Email is required",
        "contact.validation.emailInvalid": "Invalid email address",
        "contact.validation.phoneRequired": "Phone is required",
        "contact.validation.phoneMin": "Phone number must be at least 10 digits",
        "contact.validation.phoneInvalid": "Invalid phone number",
        "contact.validation.companyRequired": "Company is required",
        "contact.validation.companyMin": "Company name must be at least 2 characters",
        "contact.validation.departmentRequired": "Department is required",
        "contact.validation.messageRequired": "Message is required",
        "contact.validation.messageMin": "Message must be at least 10 characters",
        "contact.imageAlt": "Contact Us",
        "contact.locations.title": "Company Locations",
        "contact.locations.viewMap": "View on Map",
        "contact.locations.companyProfile": "Company Profile",
        "contact.locations.riyadh.title": "Riyadh Office",
        "contact.locations.riyadh.company": "Pec Engineering Consultancy.",
        "contact.locations.riyadh.address1": "First Floor | Building 11483 | Street No. 121",
        "contact.locations.riyadh.address2": "Al Yasmin District | Anas bin Malik Road",
        "contact.locations.riyadh.address3": "Riyadh | Saudi Arabia",
        "contact.locations.makkah.title": "Makkah Office",
        "contact.locations.makkah.company": "Pec Engineering Consultancy.",
        "contact.locations.makkah.address1": "Seventh Floor | Office 702 | Muhrak Tower",
        "contact.locations.makkah.address2": "Al Khalidiyah District | Third Ring Road | Makkah | Saudi Arabia",
        "contact.locations.cairo.title": "Cairo Office",
        "contact.locations.cairo.company": "pec Engineering Consultancy",
        "contact.locations.cairo.address1": "37 Salah El-Din Street - Mabahith Land - Middle Hill - Mokattam - Cairo",
        "contact.locations.cairo.address2": "Mokattam | Cairo Governorate | Egypt",
        "project.notFound": "Project not found",
        "project.owner": "Project Owner",
        "project.location": "Location",
        "project.overview": "Project Overview",
        "project.scope": "PEC Scope",
        "home.viewDetails": "View Details",
        "about.whoPec.title": "Who is PEC?",
        "about.whoPec.description": "PEC are group of professionals specialists in the building consultancy industry are cooperating for one target, it is the application of the quality principles in any project size with any customers level, these principles only having two wings meet the customer satisfaction and meet the project target (specification, cost and time)",
        "about.stats.employees": "employees",
        "about.stats.countries": "Countries",
        "about.stats.projects": "Projects done",
        "about.stats.offices": "Offices",
        "about.stats.awards": "Project Awards",
        "about.journey.subtitle": "Crafting Excellence",
        "about.journey.title": "The PEC Journey Story",
        "about.journey.description": "At PEC, our journey began with a simple yet powerful vision: to transform the vision of engineering consultancy by combining innovation, craftsmanship, and integrity. Founded 7 years ago by a team of passionate industry veterans, PEC has rapidly established itself as a trusted name in the engineering consultancy sector.",
        "about.journey.inception.title": "Mission Statement:",
        "about.journey.inception.description": "Our mission in the advisory field is to prepare all the engineering  designs Which suits the customer requirements and offer different economic alternatives In accordance with the latest local and international standards and in line with the requirements Second Republic",
        "about.journey.evolution.title": "Vision Statement:",
        "about.journey.evolution.description": "We seek a prestigious position in the field of engineering consultancy from By offering high quality designs with commitment to craftsmanship and honesty and integrity through the technical team which includes a elite of Consultants in all engineering disciplines",
        "about.journey.excellence.title": "Commitment to Excellence:",
        "about.journey.excellence.description": "At pec, excellence is not merely a goal to be achieved but a fundamental aspect of our company culture. Every member of our team, from skilled craftsmen to experienced project managers, is deeply committed to delivering outstanding quality work. This commitment is reflected in our meticulous attention to detail, our adherence to the highest industry standards, and our unwavering commitment to exceeding client expectations.",
        "about.journey.clientCentric.title": "Client-Centric Approach:",
        "about.journey.clientCentric.description": "Central to our success is our unwavering focus on our clients. We understand that each project is unique, and we take the time to listen, understand, and tailor our services to meet the specific needs and objectives of our clients. Building lasting relationships based on trust, transparency, and exceptional service is at the heart of everything we do.",
        "about.faq.subtitle": "Need more help?",
        "about.faq.title": "Frequently Asked Questions (FAQ)",
        "about.faq.q1.question": "What types of construction projects does pec specialize in?",
        "about.faq.q1.answer": "pec specializes in a wide range of construction projects, including residential, commercial, and industrial developments. From custom home builds and renovations to office buildings, retail spaces, and manufacturing facilities, we have the expertise and experience to handle diverse projects of all sizes and complexities.",
        "about.faq.q2.question": "How long does the construction process typically take?",
        "about.faq.q2.answer": "The duration of a construction project varies depending on factors such as project size, complexity, and scope. We work closely with our clients to establish realistic timelines and ensure efficient project management throughout the construction process.",
        "about.faq.q3.question": "What factors influence the cost of a construction project?",
        "about.faq.q3.answer": "Several factors can influence the cost of a construction project, including materials, labor, site conditions, project complexity, and regulatory requirements. We provide detailed cost estimates and work transparently with clients to manage budgets effectively.",
        "about.faq.q4.question": "How does pec ensure quality and safety on construction sites?",
        "about.faq.q4.answer": "Quality and safety are our top priorities. We implement rigorous quality control measures, adhere to industry best practices, and maintain strict safety protocols on all our construction sites to ensure the well-being of our workers and the integrity of our projects.",
        "about.faq.q5.question": "Can I see examples of your past projects or client testimonials?",
        "about.faq.q5.answer": "Yes! We have a portfolio of completed projects and client testimonials available on our website. We're proud of our track record and happy to share examples of our work with potential clients.",
        "about.faq.q6.question": "How do I request a quote or get started on a project with pec?",
        "about.faq.q6.answer": "Getting started is easy! Simply contact us through our website or give us a call. We'll schedule a consultation to discuss your project needs, provide a detailed quote, and outline the next steps to bring your vision to life.",
        "about.faq.q7.question": "What sets pec apart from other construction companies?",
        "about.faq.q7.answer": "Our commitment to excellence, client-centric approach, innovative solutions, and experienced team set us apart. We combine traditional craftsmanship with modern technology to deliver exceptional results that exceed expectations.",
        "vacancies.hero.title": "Join Our Team",
        "vacancies.hero.subtitle": "Build your career with a leading engineering consultancy firm. Explore exciting opportunities and become part of our dynamic team.",
        "vacancies.filters.allDepartments": "All Departments",
        "vacancies.filters.engineering": "Engineering",
        "vacancies.filters.management": "Management",
        "vacancies.filters.safety": "Safety & Security",
        "vacancies.filters.quality": "Quality Assurance",
        "vacancies.filters.allLocations": "All Locations",
        "vacancies.filters.riyadh": "Riyadh",
        "vacancies.filters.makkah": "Makkah",
        "vacancies.filters.cairo": "Cairo",
        "vacancies.filters.reset": "Reset Filters",
        "vacancies.availablePositions": "Available Positions",
        "vacancies.noJobs": "No positions match your criteria. Please try different filters.",
        "vacancies.departments.engineering": "Engineering",
        "vacancies.departments.management": "Management",
        "vacancies.departments.safety": "Safety & Security",
        "vacancies.departments.quality": "Quality Assurance",
        "vacancies.locations.riyadh": "Riyadh, Saudi Arabia",
        "vacancies.locations.makkah": "Makkah, Saudi Arabia",
        "vacancies.locations.cairo": "Cairo, Egypt",
        "vacancies.types.full-time": "Full-time",
        "vacancies.types.contract": "Contract",
        "vacancies.years": "years",
        "vacancies.applyNow": "Apply Now",
        "vacancies.jobs.civilEngineer.title": "Senior Civil Engineer",
        "vacancies.jobs.civilEngineer.description": "We are seeking an experienced Civil Engineer to lead infrastructure projects. The ideal candidate will have strong technical skills and project management experience.",
        "vacancies.jobs.civilEngineer.requirements": "Bachelor's degree in Civil Engineering, PE license preferred",
        "vacancies.jobs.projectManager.title": "Project Manager",
        "vacancies.jobs.projectManager.description": "Lead construction projects from inception to completion. Coordinate with clients, contractors, and internal teams to ensure project success.",
        "vacancies.jobs.projectManager.requirements": "PMP certification, project management experience in construction",
        "vacancies.jobs.safetyOfficer.title": "Safety Officer",
        "vacancies.jobs.safetyOfficer.description": "Ensure workplace safety compliance and implement safety protocols across construction sites. Conduct regular safety inspections and training.",
        "vacancies.jobs.safetyOfficer.requirements": "OSHA certification, experience in construction safety",
        "vacancies.jobs.architect.title": "Architectural Designer",
        "vacancies.jobs.architect.description": "Create innovative architectural designs for commercial and residential projects. Work closely with clients to bring their vision to life.",
        "vacancies.jobs.architect.requirements": "Bachelor's or Master's in Architecture, AutoCAD and Revit proficiency",

        "vacancies.jobs.qaInspector.title": "Quality Assurance Inspector",
        "vacancies.jobs.qaInspector.description": "Conduct quality inspections on construction projects to ensure adherence to specifications and standards.",
        "vacancies.jobs.qaInspector.requirements": "Engineering background, QA experience in construction",
        "vacancies.jobs.architecturalDesign.title": "Architectural Design Engineer",
        "vacancies.jobs.architecturalDesign.description": "Design and develop architectural plans and drawings for various construction projects. Work closely with clients to understand their requirements and create innovative design solutions.",
        "vacancies.jobs.architecturalDesign.requirements": "Bachelor's degree in Architecture, experience in architectural design",
        "vacancies.jobs.architecturalDrawing.title": "Architectural Working Drawing",
        "vacancies.jobs.architecturalDrawing.description": "Prepare detailed architectural working drawings and construction documents. Ensure accuracy and compliance with building codes and regulations.",
        "vacancies.jobs.architecturalDrawing.requirements": "Bachelor's degree in Architecture, proficiency in AutoCAD and Revit",
        "vacancies.jobs.structuralConcrete.title": "Structural Engineer Reinforced Concrete",
        "vacancies.jobs.structuralConcrete.description": "Design and analyze reinforced concrete structures. Perform structural calculations and prepare detailed structural drawings.",
        "vacancies.jobs.structuralConcrete.requirements": "Bachelor's degree in Civil Engineering, experience in concrete design",
        "vacancies.jobs.structuralSteel.title": "Structural Engineer Steel",
        "vacancies.jobs.structuralSteel.description": "Design steel structures and connections. Prepare shop drawings and oversee fabrication and erection processes.",
        "vacancies.jobs.structuralSteel.requirements": "Bachelor's degree in Civil Engineering, experience in steel structure design",
        "vacancies.jobs.electricalEngineer.title": "Electrical Engineer Power and Low Current",
        "vacancies.jobs.electricalEngineer.description": "Design electrical power distribution systems and low current systems including security, fire alarm, and telecommunications.",
        "vacancies.jobs.electricalEngineer.requirements": "Bachelor's degree in Electrical Engineering",
        "vacancies.jobs.mechanicalEngineer.title": "Mechanical Engineer Plumbing and Fire",
        "vacancies.jobs.mechanicalEngineer.description": "Design plumbing and fire fighting systems for buildings. Ensure compliance with safety standards and regulations.",
        "vacancies.jobs.mechanicalEngineer.requirements": "Bachelor's degree in Mechanical Engineering, experience in MEP design",
        "vacancies.jobs.technicalOffice.title": "Structural Technical Office Engineer (Shop Drawings and Quantity Surveying)",
        "vacancies.jobs.technicalOffice.description": "Prepare shop drawings and perform quantity surveying for structural elements. Coordinate with design and construction teams.",
        "vacancies.jobs.technicalOffice.requirements": "Bachelor's degree in Civil Engineering, proficiency in structural software",
        "vacancies.jobs.architecturalSupervision.title": "Architectural Supervision Engineer",
        "vacancies.jobs.architecturalSupervision.description": "Supervise architectural works on construction sites. Ensure compliance with design specifications and quality standards.",
        "vacancies.jobs.architecturalSupervision.requirements": "Bachelor's degree in Architecture, site supervision experience",
        "vacancies.jobs.structuralSupervision.title": "Structural Supervision Engineer",
        "vacancies.jobs.structuralSupervision.description": "Supervise structural works on construction sites. Monitor construction quality and compliance with structural design.",
        "vacancies.jobs.structuralSupervision.requirements": "Bachelor's degree in Civil Engineering, site supervision experience",
        "vacancies.jobs.mechanicalSupervision.title": "Mechanical Supervision Engineer",
        "vacancies.jobs.mechanicalSupervision.description": "Supervise mechanical installations including HVAC, plumbing, and fire fighting systems on construction sites.",
        "vacancies.jobs.mechanicalSupervision.requirements": "Bachelor's degree in Mechanical Engineering, site supervision experience",
        "vacancies.whyJoin.title": "Why Join Us?",
        "vacancies.whyJoin.subtitle": "We offer competitive benefits and a supportive work environment that helps you grow professionally and personally.",
        "vacancies.benefits.salary.title": "Competitive Salary",  
        "vacancies.benefits.salary.description": "Industry-leading compensation packages with performance bonuses",
        "vacancies.benefits.training.title": "Professional Development",
        "vacancies.benefits.training.description": "Continuous learning opportunities and career advancement programs",
        "vacancies.benefits.health.title": "Health Benefits",
        "vacancies.benefits.health.description": "Comprehensive medical insurance for you and your family",
        "vacancies.benefits.culture.title": "Great Culture",
        "vacancies.benefits.culture.description": "Collaborative environment with diverse teams and inclusive policies",
        "vacancies.application.title": "Apply for Position",
        "vacancies.application.firstName": "First Name",
        "vacancies.application.lastName": "Last Name",
        "vacancies.application.email": "Email Address",
        "vacancies.application.phone": "Phone Number",
        "vacancies.application.experience": "Years of Experience",
        "vacancies.application.selectExperience": "Select your experience level",
        "vacancies.application.resume": "Upload Resume",
        "vacancies.application.resumeFormat": "Accepted formats: PDF, DOC, DOCX (Max 5MB)",
        "vacancies.application.coverLetter": "Cover Letter (Optional)",
        "vacancies.application.submit": "Submit Application",
        "vacancies.application.cancel": "Cancel"
        
  }